<a href="https://colab.research.google.com/github/bsudharshan2001/MyRespository/blob/master/College/Semester-5/19CSE304-DataScience/CB.EN.U4CSE19008_chisq.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

19CSE304 - Data Science - Lab 13th October
------------------
---
B Sudharshan - CB.EN.U4CSE19008 - CSE A

In [ ]:
import pandas as pd
import numpy as np
import math
from sklearn.preprocessing import LabelEncoder
import scipy.stats as stats

In [ ]:
pip install researchpy

Collecting researchpy
  Downloading researchpy-0.3.2-py3-none-any.whl (15 kB)
Requirement already satisfied: statsmodels in /usr/local/lib/python3.7/dist-packages (from researchpy) (0.10.2)
Requirement already satisfied: patsy in /usr/local/lib/python3.7/dist-packages (from researchpy) (0.5.2)
Requirement already satisfied: numpy in /usr/local/lib/python3.7/dist-packages (from researchpy) (1.19.5)
Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (from researchpy) (1.1.5)
Requirement already satisfied: scipy in /usr/local/lib/python3.7/dist-packages (from researchpy) (1.4.1)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas->researchpy) (2.8.2)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.7/dist-packages (from pandas->researchpy) (2018.9)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas->researchpy) (1.15.0)
Installing collected packages: researchpy
Successfully installed researchpy-0.3.2

In [ ]:
import researchpy as rp
missing_values=['--','n/a','na']

/usr/local/lib/python3.7/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [ ]:
df=pd.read_csv('/content/train.csv')
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [ ]:
df.shape

(891, 12)

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
mean_age=df['Age'].mean()
mean_age=math.ceil(mean_age)
print(mean_age)

30

In [ ]:
df['Age']=df['Age'].fillna(mean_age)

In [ ]:
df["Cabin"]=df['Cabin'].fillna(method='bfill')
df['Embarked']=df['Embarked'].fillna(method='bfill')
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          1
Embarked       0
dtype: int64

In [ ]:
df=df.dropna()
df.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [ ]:
labelEnc=LabelEncoder()
df['Sex']=labelEnc.fit_transform(df['Sex'])
df

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

     PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0              1         0       3  ...   7.2500    C85         S
1              2         1       1  ...  71.2833    C85         C
2              3         1       3  ...   7.9250   C123         S
3              4         1       1  ...  53.1000   C123         S
4              5         0       3  ...   8.0500    E46         S
..           ...       ...     ...  ...      ...    ...       ...
885          886         0       3  ...  29.1250    B42         Q
886          887         0       2  ...  13.0000    B42         S
887          888         1       1  ...  30.0000    B42         S
888          889         0       3  ...  23.4500   C148         S
889          890         1       1  ...  30.0000   C148         C

[890 rows x 12 columns]

In [ ]:
#3.Count the total number of passengers on board the Titanic.
print(df.PassengerId.nunique())

890

In [ ]:
#4.Count the number of passengers who survived the sinking of the Titanic.
print(df.Survived.value_counts())

0    548
1    342
Name: Survived, dtype: int64

In [ ]:
n=0
for i in range(len(df)):
  if(df['Survived'][i]==1):
    n+=1
print(str(n)+" Survived")

342 Survived

In [ ]:
#5.Measure the percentage of passengers who survived the sinking of the Titanic.
percent_survived=round((n/df.shape[0])*100,2)
print(str(percent_survived)+" survived")

38.43 survived

In [ ]:
#6.Count the number of passengers based on gender
df.Sex.value_counts()

1    576
0    314
Name: Sex, dtype: int64

In [ ]:
m=f=0
for i in range(len(df)):
  if(df['Sex'][i]==1):
    m+=1
  if(df['Sex'][i]==0):
    f+=1
print("male: "+str(m))
print("female: "+str(f))

male: 576
female: 314

In [ ]:
#7.Run a Pearson’s Chi-squared test to test the following hypothesis:

Hypothesis: The proportion of females onboard who survived the sinking of the Titanic was higher than the proportion of males onboard who survived the sinking of the Titanic.

In [ ]:
crosstab = pd.crosstab(df['Sex'],df['Survived'])

In [ ]:
stats.chi2_contingency(crosstab)

(260.1359083205794,
 1.602844540444506e-58,
 1,
 array([[193.33932584, 120.66067416],
        [354.66067416, 221.33932584]]))

In [ ]:
crosstab, results, expected = rp.crosstab(df['Sex'],df['Survived'],test='chi-square',expected_freqs=True,prop='cell')
results

                Chi-square test   results
0  Pearson Chi-square ( 1.0) =   262.4671
1                    p-value =     0.0000
2               Cramer's phi =     0.5431

In [ ]:
expected

            Survived
Survived           0           1
Sex
0         193.339326  120.660674
1         354.660674  221.339326